In [1]:
import pandas as pd
india_weather=pd.DataFrame({
    'city':["mumbai","delhi","banglore"],
    'temperature':[32,45,30],
    'humidity':[80,60,78]
})

In [2]:
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather=pd.DataFrame({
    'city':["new york","chicago","orlando"],
    'temperature':[21,14,35],
    'humidity':[68,65,75]
})

In [4]:
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [6]:
"""
we want to joing these two dataframes so that i can get a single data frame
which has weather data for all these cities in india and usa
"""
pd.concat([india_weather,us_weather])

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [7]:
"""
we want a continuous index
using ignore index
"""
df=pd.concat([india_weather,us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [8]:
"""
retrieving weater data from idian cities from the above dataframe
ny passing an additional arguement called keys
what keys does is- you can associate a key for each of the dataframe
"""
df=pd.concat([india_weather,us_weather],keys=["india","us"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [9]:
"""
using indian and us index
useful for getting original dataframe-key
"""
df.loc["india"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [38]:
"""
Sometimes we want to append second dataframe as a column 
instead of a row
"""
temperature_df=pd.DataFrame({
    'city':["mumbai","delhi","banglore"],
    'temperature':[32,45,30]
},index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [39]:
windspeed_df=pd.DataFrame({
    'city':["delhi","mumbai"],
    'windspeed':[7,12]
},index=[1,0])
windspeed_df
"""
if the order of cities os diffirent from that of temperature
index is a way to align rows from different dataframes
"""

'\nif the order of cities os diffirent from that of temperature\n\n'

In [40]:
"""
WE want both the dataframes to appear as columns
using axis-1(column)-0(rows) arguement
"""
df = pd.concat([temperature_df,windspeed_df],axis=1, sort=True)

In [41]:
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [42]:
"""
Joining a dataframe with a series
"""
s=pd.Series(["Humid","Dry","Rain"],name="event")

In [43]:
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [44]:
"""
we want to append the serues to the above dataframe
"""
df=pd.concat([temperature_df,s],axis=1)

In [45]:
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain